"standard.cancel" = "キャンセル";
"standard.action.label" = "アクション";
"standard.action.tooltip" = "選択した項目でタスクを実行";

"standard.toolbar.hide.title" = "ツールバーを隠す";
"standard.toolbar.show.title" = "ツールバーを表示";
"standard.toolbar.mode.icon-and-label" = "アイコンとテキスト";
"standard.toolbar.mode.icon-only" = "アイコンのみ";


// Global
"app.menu.view.toggle-toolbar.key-equivalent" = "command |";
"app.menu.view.show-navigator.title" = "ツールペインを表示";
"app.menu.view.hide-navigator.title" = "ツールペインを隠す";
"app.menu.preview.show-preview.title" = "Web プレビューを表示";
"app.menu.preview.open-new-preview.title" = "新規 Web プレビュー";

"app.decide.should-empty-caches.message" = "本当にすべてのキャッシュをクリアしますか？";
"app.decide.should-empty-caches.message-info" = "Espresso は、Web プレビューの内容や関連する情報をキャッシュに保存し、 ページを読み込んだりアプリケーションを使用する際の実行速度を高速化しています。";
"app.decide.should-empty-caches.button.continue" = "空にする";
"app.decide.should-empty-caches.button.cancel" = "@alias standard.cancel";

"app.decide.should-quit-ignoring-transfer.title" = "転送中です。";
"app.decide.should-quit-ignoring-transfer.title (transfers-count:%@)" = "%@ 転送中です。";
"app.decide.should-quit-ignoring-transfer.message" = "本当に終了しますか? 終了してしまうと、Espresso はファイルを最後まで転送できません。その結果、データが失われる可能性があります。";
"app.decide.should-quit-ignoring-transfer.message (transfers-count:%@)" = "";
"app.decide.should-quit-ignoring-transfer.button.cancel.title" = "終了しない";
"app.decide.should-quit-ignoring-transfer.button.proceed.title" = "終了";


// Project window
"project.window.title(document:%@ - project:%@)" = "%@ — %@";


// Project sidebar
"project.sidebar.workspace.title" = "ワークスペース";
"project.sidebar.workspace.placeholder-no-tabs" = "ファイルをここにドロップするかダブルクリックするとタブで開きます。";
"project.sidebar.workspace.tabs.menu.reveal-in-project.title" = "プロジェクトファイルに表示";

"project.sidebar.search.title" = "検索と置換";
"project.sidebar.search-results.title" = "検索結果";

"project.sidebar.files.title" = "プロジェクトファイル";
"project.sidebar.files.placeholder-requesting-directory" = "読み込み中…";
"project.sidebar.files.placeholder-empty-directory" = "このプロジェクトには現在ファイルがありません。";
"project.sidebar.files.placeholder-searching" = "検索中…";
"project.sidebar.files.placeholder-no-search-results" = "マッチするファイルがありませんでした。";
"project.sidebar.files.action.tooltip" = "@alias standard.action.tooltip";
"project.sidebar.files.filter.tooltip" = "名前でクイックフィルタ";
"project.sidebar.files.clear-search.tooltip" = "検索結果を消去";
"project.sidebar.files.clear-or-change-search.tooltip" = "クリックすると検索結果を消去; Option + クリックで検索条件を変更";
"project.sidebar.files.open-in-workspace.title" = "ワークスペースに開く";

"project.sidebar.publish.title" = "公開";
"project.sidebar.publish.placeholder-no-servers" = "ロジェクトの設定で公開サーバーを追加します。";


// Project toolbar
"project.toolbar.switcher.label" = "プロジェクト";
"project.toolbar.switcher.label-customize" = "プロジェクトビュー";
"project.toolbar.switcher.tooltip" = "ワークスペースを表示またはプロジェクトを検索";

"project.toolbar.new.label" = "新規";
"project.toolbar.new.label-customize" = "プロジェクトに新規作成";
"project.toolbar.new.tooltip" = "新規項目をワークスペースまたはプロジェクトに追加";

"project.toolbar.settings.label" = "設定";
"project.toolbar.settings.label-customize" = "プロジェクト設定";
"project.toolbar.settings.tooltip" = "プロジェクト設定を編集";


// Project Settings
"project.settings.title" = "プロジェクト設定";

"project.settings.decide.should-save-changes.message (project-name:%@)" = "変更内容を “%@” に保存しますか？";
"project.settings.decide.should-save-changes.message-info" = "保存しない場合、変更内容は失われます。";
"project.settings.decide.should-save-changes.button.save" = "設定を保存する";
"project.settings.decide.should-save-changes.button.discard" = "保存しない";


// Project Settings: Servers
"project.settings.publish-servers.title" = "サーバ + 同期";

"project.settings.decide.should-remove-server.message (server:%@)" = "本当にサーバ “%@” を削除しますか？";
"project.settings.decide.should-remove-server.message-info" = "この操作を取り消すことはできません。";
"project.settings.decide.should-remove-server.button.delete" = "サーバを削除";


// Project Settings: Non-persistent Project (e.g. folder dragged to Dock)
"project.settings.non-persistent-project.title" = "Make a new Project to change settings…";


// Project Find and Replace
"project.find-replace.decide.should-replace.title.one (search:%@ replace:%@)" = "本当に %@ のうちひとつを %@ で置換しますか？";

"project.find-replace.decide.should-replace.title.multiple (found-count:%@ search:%@ replace:%@)" = "本当に %2$@ の %1$@ を 全件 %3$@ で置換しますか？";

"project.find-replace.decide.should-replace.title.selected-one (found-count:%@ search:%@ replace:%@)" = "本当に選択中の %2$@ 件中、1 件の %1$% を %3$@ で置換しますか？";

"project.find-replace.decide.should-replace.title.selected-multiple (selected-count:%@ found-count:%@ search:%@ replace:%@)" = "本当に選択中 %2$@ 件中、%1$@ 件%の %3$@ を %$4@ で置換しますか？";


"project.find-replace.decide.should-replace.message" = "変更があった書類はすぐに保存、もしくはワークスペースに追加されます。ワークスペースに追加されないと書類に行った変更を取り消すことはできません。";


"project.find-replace.decide.should-replace.fragment.search-string (string:%@)" = "“%@”";
"project.find-replace.decide.should-replace.fragment.replace-string (string:%@)" = "“%@”";
"project.find-replace.decide.should-replace.fragment.search-regex" = "正規表現";
"project.find-replace.decide.should-replace.fragment.replace-regex" = "置換表現";
"project.find-replace.decide.should-replace.fragment.truncated (prefix:%@ suffix:%@)" = "%@…%@";

"project.find-replace.decide.should-replace.button.replace-all.title" = "すべて置換";
"project.find-replace.decide.should-replace.button.replace-selected.title" = "置換";
"project.find-replace.decide.should-replace.button.cancel.title" = "@alias standard.cancel";


// Document
"text-editor.sidebar.navigator.title" = "ナビゲータ";

"text-editor.toolbar.action.label" = "@alias standard.action.label";
"text-editor.toolbar.action.tooltip" = "選択したテキストでタスクを実行";

"text-editor.toolbar.tools.label" = "   ツール";   // Unicode: thin space + 2x hair space, approx 5px
"text-editor.toolbar.tools.tooltip" = "ナビゲータとツールを表示／隠す";


// Code folding
"text-editor.folding-actions.fold-selection.title" = "折りたたむ";
"text-editor.folding-actions.unfold-selection.title" = "展開する";
"text-editor.folding-actions.unfold-all.title" = "すべて展開";


// Server bookmarks
"server-bookmark.untitled" = "名称未設定のサーバ";


// Server browser + sync
"server.toolbar.view.label" = "同期または表示";
"server.toolbar.view.tooltip" = "サーバに同期して内容をリストまたは列で表示";
"server.toolbar.filter.label" = "検索";

"server.status.connecting (server:%@)" = "%@ に接続中…";
"server.status.authenticating" = "認証中…";


// Server browser
"server-browser.toolbar.action.placeholder-not-connected" = "切断";
"server-browser.toolbar.action.label" = "@alias standard.action.label";
"server-browser.toolbar.action.tooltip" = "@alias standard.action.tooltip";

"server-browser.columns.name.title" = "名前";
"server-browser.columns.name.size" = "サイズ";
"server-browser.columns.name.date-modified" = "最終更新日時";

"server-browser.sidebar.general.title" = "全般";
"server-browser.sidebar.permissions.title" = "アクセス権限";
"server-browser.sidebar.activity.title" = "アクティビティ";

"server-browser.status.disconnected" = "切断";
"server-browser.status.requesting-initial-directory" = "初期ディレクトリを要求…";
"server-browser.status.connected" = "接続済";

// Server browser toolbar start button
"server-browser.connect.title" = "表示…";


// Server sync
"server-sync.toolbar.action.label" = "@alias standard.action.label";
"server-sync.toolbar.action.tooltip" = "@alias standard.action.tooltip";

"server-sync.choose-mode.update.title" = "変更箇所をサーバと同期";
"server-sync.choose-mode.download.title" = "サーバから変更箇所をダウンロード";
"server-sync.choose-mode.merge.title" = "サーバとプロジェクトをマージ";
"server-sync.choose-mode.settings.title" = "設定";
"server-sync.settings.detection-mode.header.title" = "変更箇所を検出:";
"server-sync.settings.detection-mode.automatic.title" = "自動";
"server-sync.settings.detection-mode.using-size.title" = "ファイルサイズで";
"server-sync.settings.detection-mode.using-modification-date.title" = "最終更新日時で";
"server-sync.settings.server-time.clear.title" = "検出されたサーバ時間をクリア";

"server-sync.server-time.about-the-same" = "サーバ時間はほぼ同じです";
"server-sync.server-time.ahead (%@)" = "サーバ時間は %@ 進んでいます";
"server-sync.server-time.behind (%@)" = "サーバ時間は %@ 遅れています";

"server-sync.time-interval-delimiter" = ", ";
"server-sync.time-interval-minute (1)" = "1 分";
"server-sync.time-interval-minutes (%@)" = "%@ 分";
"server-sync.time-interval-hour (1)" = "1 時間";
"server-sync.time-interval-hours (%@)" = "%@ 時間";
"server-sync.time-interval-day (1)" = "1 日";
"server-sync.time-interval-days (%@)" = "%@ 日";

"server-sync.start-review.title" = "同期…";
"server-sync.start-operations.title" = "同期";
"server-sync.done.title" = "完了";

"server-sync.operation.skip" = "スキップ";
"server-sync.operation.always-skip" = "常にスキップ";

"server-sync.operation.copy-a-to-b" = "アップロード";
"server-sync.operation.copy-a-to-b.in-progress" = "アップロード中…";
"server-sync.operation.copy-a-to-b.finished" = "アップロード済";
"server-sync.operation.copy-a-to-b.failed" = "アップロードできませんでした";

"server-sync.operation.copy-b-to-a" = "ダウンロード";
"server-sync.operation.copy-b-to-a.in-progress" = "ダウンロード中…";
"server-sync.operation.copy-b-to-a.finished" = "ダウンロード済";
"server-sync.operation.copy-b-to-a.failed" = "ダウンロードできませんでした";

"server-sync.operation.remove-a" = "プロジェクトから削除";
"server-sync.operation.remove-a.in-progress" = "削除中…";
"server-sync.operation.remove-a.finished" = "削除済";
"server-sync.operation.remove-a.failed" = "削除できませんでした";

"server-sync.operation.remove-b" = "サーバから削除";
"server-sync.operation.remove-b.in-progress" = "削除中…";
"server-sync.operation.remove-b.finished" = "削除済";
"server-sync.operation.remove-b.failed" = "削除できませんでした";

"server-sync.operation.waiting" = "待機しています…";

// Server sync action menu
"server-sync.actions.diff.title" = "Show Difference";
"server-sync.action-categories.assign-operation.title" = "アクションを選択:";
"server-sync.actions.assign-operation.skip.title" = "@alias server-sync.operation.skip";
"server-sync.actions.assign-operation.always-skip.title" = "@alias server-sync.operation.always-skip";
"server-sync.actions.assign-operation.copy-a-to-b.title" = "@alias server-sync.operation.copy-a-to-b";
"server-sync.actions.assign-operation.copy-b-to-a.title" = "@alias server-sync.operation.copy-b-to-a";
"server-sync.actions.assign-operation.remove-a.title" = "@alias server-sync.operation.remove-a";
"server-sync.actions.assign-operation.remove-b.title" = "@alias server-sync.operation.remove-b";
"server-sync.actions.clear-all-operations.title" = "アクションをすべて消去";

// Server sync status while connecting/reviewing
"server-sync.status.disconnected" = "Keep your project and server in sync. Nothing will be published until you've reviewed the proposed changes.";
"server.status.detecting-time" = "Detecting server time…";
"server-sync.status.reviewing-folders" = "Reviewing changes…";
"server-sync.status.reviewing-folders (reviewed-count:%@ found-count:%@)" = "Reviewed changes for %@ of %@ folders…";

// Server sync toolbar start button
"server-sync.button.preview-sync-actions.title" = "同期…";


// Image preview
"image-viewer.toolbar.zoom-controls.label" = "拡大／縮小";
"image-viewer.toolbar.zoom-controls.tooltip" = "";

"image-viewer.toolbar.zoom-to-fit.label" = "Zoom to Fit";
"image-viewer.toolbar.zoom-to-fit.tooltip" = "";


// Web Preview
"web-preview.error.cannot-preview-untitled-document" = "Do you want to save this document?";
"web-preview.error.cannot-preview-untitled-document.message" = "You need to save the document before it can be shown in a Web Preview.";
"web-preview.error.cannot-preview-untitled-document.button.save.title" = "Save and Preview…";

"web-preview.error.cannot-preview-remote-document" = "Can't preview remote documents directly.";
"web-preview.error.cannot-preview-remote-document.message" = "Open a new Web Preview and enter the website URL of the page.";
"web-preview.error.cannot-preview-remote-document.button.open-new-preview.title" = "新規 Web プレビュー";

"web-preview.xray.inspector.click-to-open" = "Click to open.";
"web-preview.xray.inspector.click-to-extract-or-override" = "Click to extract or override.";


// Preview: Style Sheets Menu
"Edit Style Sheet:" = "スタイルシートを編集:";
"Edit Style Sheets:" = "Edit Style Sheets:";
" (overridden by %@)" = " (overridden by “%@”)";   // File name format if the file was overridden
" - %@" = " — %@";   // Appended after the file name: path to the style sheet
"Manage Style Sheet Overrides..." = "Manage Style Sheet Overrides…";

// Override HUD
"%@ -- %@" = "%@ — %@";
"> %@ (overridden)" = "↪ %@ (overridden)";